# MmSup2PerM Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..MmSup2PerM Property
SymbolTypeId Class See Also
---
Symbol mm²/m, indicating unit Square millimeters per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MmSup2PerM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MmSup2PerM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MmSup2PerM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace